app/Controllers/MateriController.php

SELECT *
FROM `materi`
---
    public function index()
    {
        $materiModel = new MateriModel();
        $data['materi'] = $materiModel->findAll(); // Mengambil semua data materi