app/Models/GuruModel.php

    public function getGuru($nip = false)
    {
        if ($nip === false) {
            return $this->findAll();
        } else {
            return $this->getWhere(['nip' => $nip]);
---
SELECT *
FROM `guru`

    public function saveGuru($data)
    {
        $query = $this->db->table($this->table)->insert($data);
---
INSERT INTO `guru` (`nip`, `nama_lengkap`, `email`, `mapel`) VALUES ('12345', 'Rafi 3', 'rafi3@gmail.com', 'Matematika')

    public function editGuru($data, $nip)
    {
        $query = $this->db->table($this->table)->update($data, ['nip' => $nip]);
---
UPDATE `guru` SET `nama_lengkap` = 'Rafi Zaki', `email` = 'rafi3@gmail.com', `mapel` = 'Matematika'
WHERE `nip` = '12345'