app/Models/MateriModel.php

    public function getMateri($id = false)
    {
        if ($id === false) {
            return $this->findAll();
---
SELECT *
FROM `materi`